# GetSubDivisionIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid..::..GetSubDivisionIds Method
Toposolid Class See Also
---
Get all element ids of toposolid subdivisions with the current toposolid as its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<ElementId> GetSubDivisionIds()
```

Visual Basic
---
```text
Public Function GetSubDivisionIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetSubDivisionIds()
```

# ### Return Value
The array of toposolid subdivision ids.
# See Also
Toposolid Class
Autodesk.Revit.DB Namespace